app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."user_id" = 4 LIMIT 1
---
  def list
    @users = User.all